{
  "Bid Number": "Not Provided",
  "Title": "Dell Latitude 5550 XCTO Base Intel Core Ultra 5 125U processor",
  "Due Date": "Not Provided",
  "Bid Submission Type": "Not Provided",
  "Term of Bid": "pricing is valid for thirty days from the date of this Quote",
  "Pre Bid Meeting Details": "Not Provided",
  "Installation Requirements": "Not Provided",
  "Bid Bond Requirement": "Not Provided",
  "Delivery Timeline": "Not Provided",
  "Payment Terms": "Taxes and/or freight charges listed on this Quote are only estimates. The final amounts shall be stated on the relevant invoice. Additional freight charges will be applied if Customer requests expedited shipping.",
  "Required Documentation": "Please indicate any tax exemption status on your purchase order and send your tax exemption certificate to Tax_Department@dell.com or ARSalesTax@emc.com, as applicable.",
  "Manufacturer Registration": "Not Provided",
  "Cooperative Contract Options": "Not Provided",
  "Product Models": [
    "Dell Latitude 5550"
  ],
  "Product Part Numbers": [
    "210-BLYZ",
    "379-BFNZ",
    "619-ARSB",
    "658-BCSB",
    "338-CNRG",
    "338-CNRK",
    "321-BKTQ",
    "409-BCXY",
    "631-BBSQ",
    "370-BBTL",
    "400-BRFT",
    "391-BJHB",
    "583-BLNH",
    "555-BKQC",
    "555-BKLQ",
    "451-BDGX",
    "492-BDMN",
    "346-BKLV",
    "537-BBDO",
    "340-DMNY",
    "340-AGIK",
    "387-BBPC",
    "817-BBBB",
    "658-BFQB",
    "340-DMMK",
    "389-FGSN",
    "319-BBKK",
    "634-BRWG",
    "379-BDZBSI"
  ],
  "Product Categories": "Not Provided",
  "Contact Information": "Dell Marketing LP is located at One Dell Way, Mail Stop 8129, Round Rock, TX 78682",
  "Issuing Organization": "Dell Marketing LP",
  "Bid Objective Summary": "This Quote will, if Customer issues a purchase order for the quoted items that is accepted by Supplier, constitute a contract between the entity issuing this Quote (“Supplier”) and the entity to whom this Quote was issued (“Customer”).",
  "Technical Specifications": "Dell Latitude 5550 XCTO Base, Intel Core Ultra 5 125U processor (12 MB cache, 12 cores, 14 threads, up to 4.3 GHz Turbo), Windows 11 Pro, English, Brazilian Portuguese PT-BR, French, Spanish, No Microsoft Office License Included - 30 day Trial Offer Only, Assembly Base MTL 5550, Integrated Intel graphics for Intel Core Ultra 5 125U processor, Latitude 5550 Bottom Door, MTL U15, Intel Rapid Storage Technology Driver, Intel vPro Management Disabled, 16 GB: 2 x 8 GB, DDR5, 5600 MT/s (5200 MT/s with 13th Gen Intel Core processors), 256 GB, M.2 2230, TLC, Gen 4 PCIe NVMe, SSD, 15.6\", FHD 1920x1080, 60Hz, IPS, Non-Touch, AG, 250 nit, 45% NTSC, FHD Cam, English US backlit AI hotkey keyboard with numeric keypad, 99-key, Intel AX211 WLAN Driver, Intel Wi-Fi 6E (6 where 6E unavailable) AX211, 2x2, 802.11ax, Bluetooth 5.3 wireless card, 3-cell, 54 Wh, ExpressCharge Capable, ExpressCharge Boost Capable, 65W AC adapter, USB Type-C, EcoDesign, No Security E4 Power Cord 1M for US, Latitude 5550 Quick Start Guide, SERI Guide (ENG/FR/Multi), ENERGY STAR Qualified, Custom Configuration, Dell Additional Software, Mix Model MTL 65WADPT, Intel Core Ultra 5 Non-vPro Label, FHD HDR RGB Camera, TNR, Camera Shutter, Microphone, Windows AutoPilot, EPEAT 2018 Registered (Gold)"
}